Jkvb/esp32-c6Touch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Physical module flash is 8 MB. The application remains in a conservative
# 2 MB factory partition until OTA storage is designed.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# BLE is intentionally disabled in this UI milestone. It will be enabled with
# the motor-control supervisor instead of carrying unused radio code today.
# CONFIG_BT_ENABLED is not set

CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_MONTSERRAT_32=y
